In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1

In [4]:
df['FlightNumber'].isnull().sum()

2

In [5]:
df['FlightNumber']='10045 10055 10065 10075 10085'.split()

In [6]:
 df['FlightNumber']=df['FlightNumber'].astype(int)

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [8]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

# 2

In [9]:
b=[]
for i in range(5):
    b.append((df['From_To'][i]))

In [10]:
From=[]
To=[]
for i in range(5):
    j=b[i].find('_')
    From.append(b[i][:j])
    To.append(b[i][j+1:])

In [11]:
From

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [12]:
To

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [13]:
df['To']=pd.Series(data=To)
df['From']=pd.Series(data=From)

In [14]:
df

,From_To,FlightNumber,RecentDelays,Airline,To,From
0,LoNDon_paris,10045,"[23, 47]",KLM(!),paris,LoNDon
1,MAdrid_miLAN,10055,[],<Air France> (12),miLAN,MAdrid
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),StockhOlm,londON
3,Budapest_PaRis,10075,[13],12. Air France,PaRis,Budapest
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",londOn,Brussels

# 3

In [15]:
df['To'] = df['To'].str.capitalize() 
df['From'] = df['From'].str.capitalize()

In [16]:
df

,From_To,FlightNumber,RecentDelays,Airline,To,From
0,LoNDon_paris,10045,"[23, 47]",KLM(!),Paris,London
1,MAdrid_miLAN,10055,[],<Air France> (12),Milan,Madrid
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London
3,Budapest_PaRis,10075,[13],12. Air France,Paris,Budapest
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",London,Brussels

# 4

In [17]:
df.drop(['From_To'],axis=1,inplace=True)

In [18]:
df

   FlightNumber  RecentDelays              Airline         To      From
0         10045      [23, 47]               KLM(!)      Paris    London
1         10055            []    <Air France> (12)      Milan    Madrid
2         10065  [24, 43, 87]  (British Airways. )  Stockholm    London
3         10075          [13]       12. Air France      Paris  Budapest
4         10085      [67, 32]          "Swiss Air"     London  Brussels

# 5

In [19]:
delay=pd.DataFrame((df['RecentDelays']).values.tolist(),columns=['delay1','delay2','delay3'])

In [20]:
delay

   delay1  delay2  delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [21]:
df.drop(['RecentDelays'],axis=1,inplace=True)

In [22]:
df_new=pd.concat([df,delay],axis=1)

In [23]:
df_new

,FlightNumber,Airline,To,From,delay1,delay2,delay3
0,10045,KLM(!),Paris,London,23.0,47.0,NaN
1,10055,<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,10065,(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,10075,12. Air France,Paris,Budapest,13.0,NaN,NaN
4,10085,"""Swiss Air""",London,Brussels,67.0,32.0,NaN